
# Specify the path to the processed files
PROCESSED_DATA_PATH = 'KanaRecognizer/trainer/processed_data'

HANDWRITING_HIRAGANA_LABEL_LIST = \
    ['あ', 'い', 'う', 'え', 'お', 'か', 'が', 'き', 'ぎ', 'く'] + \
    ['ぐ', 'け', 'げ', 'こ', 'ご', 'さ', 'ざ', 'し', 'じ', 'す'] + \
    ['ず', 'せ', 'ぜ', 'そ', 'ぞ', 'た', 'だ', 'ち', 'ぢ', 'つ'] + \
    ['つ', 'づ', 'て', 'で', 'と', 'ど', 'な', 'に', 'ぬ', 'ね'] + \
    ['の', 'は', 'ば', 'ぱ', 'ひ', 'び', 'ぴ', 'ふ', 'ぶ', 'ぷ'] + \
    ['へ', 'べ', 'ぺ', 'ほ', 'ぼ', 'ぽ', 'ま', 'み', 'む', 'め'] + \
    ['も', 'や', 'や', 'ゆ', 'ゆ', 'よ', 'よ', 'ら', 'り', 'る'] + \
    ['れ', 'ろ', 'わ', 'を', 'ん']

PRONUNCIATION_LIST = \
    ['a', 'i', 'u', 'e', 'o', 'ka', 'ga', 'ki', 'gi', 'ku'] + \
    ['gu', 'ke', 'ge', 'ko', 'go', 'sa', 'za', 'shi', 'ji', 'su'] + \
    ['zu', 'se', 'ze', 'so', 'zo', 'ta', 'da', 'chi', 'di', ''] + \
    ['tsu', 'du', 'te', 'de', 'to', 'do', 'na', 'ni', 'nu', 'ne'] + \
    ['no', 'ha', 'ba', 'pa', 'hi', 'bi', 'pi', 'fu', 'bu', 'pu'] + \
    ['he', 'be', 'pe', 'ho', 'bo', 'po', 'ma', 'mi', 'mu', 'me'] + \
    ['mo', '', 'ya', '', 'yu', '', 'yo', 'ra', 'ri', 'ru'] + \
    ['re', 'ro', 'wa', 'wo', 'n']

KATAKANA_LIST = \
    ['ア', 'イ', 'ウ', 'エ', 'オ', 'カ', 'ガ', 'キ', 'ギ', 'ク'] + \
    ['グ', 'ケ', 'ゲ', 'コ', 'ゴ', 'サ', 'ザ', 'シ', 'ジ', 'ス'] + \
    ['ズ', 'セ', 'ゼ', 'ソ', 'ゾ', 'タ', 'ダ', 'チ', 'ヂ', ''] + \
    ['ツ', 'ヅ', 'テ', 'デ', 'ト', 'ド', 'ナ', 'ニ', 'ヌ', 'ネ'] + \
    ['ノ', 'ハ', 'バ', 'パ', 'ヒ', 'ビ', 'ピ', 'フ', 'ブ', 'プ'] + \
    ['ヘ', 'ベ', 'ペ', 'ホ', 'ボ', 'ポ', 'マ', 'ミ', 'ム', 'メ'] + \
    ['モ', '', 'ヤ', '', 'ユ', '', 'ヨ', 'ラ', 'リ', 'ル'] + \
    ['レ', 'ロ', 'ワ', 'ヲ', 'ン']

HANDWRITING_KATAKANA_LABEL_LIST = \
    ['ヲ', 'イ', 'エ', 'ア', 'イ', 'ウ', 'エ', 'オ', 'カ', 'キ'] + \
    ['ク', 'ケ', 'コ', 'サ', 'シ', 'ス', 'セ', 'ソ', 'タ', 'チ'] + \
    ['ツ', 'テ', 'ト', 'ナ', 'ニ', 'ヌ', 'ネ', 'ノ', 'ハ', 'ヒ'] + \
    ['フ', 'ヘ', 'ホ', 'マ', 'ミ', 'ム', 'メ', 'モ', 'ヤ', 'ユ'] + \
    ['ヨ', 'ラ', 'リ', 'ル', 'レ', 'ロ', 'ワ', 'ン']

HANDWRITING_EQUIVALENT_CHAR_LIST = [
    {'ゃ', 'や'},
    {'ゅ', 'ゆ'},
    {'ょ', 'よ'},
    {'っ', 'つ'},
    {'ｨ', 'ｲ'},
    {'ｪ', 'ｴ'},
]
